garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1709.PIC
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC1POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC1POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF11">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G1POL" edc:desc="" edc:mask="0x1" edc:name="LC1G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2POL" edc:desc="" edc:mask="0x1" edc:name="LC1G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3POL" edc:desc="" edc:mask="0x1" edc:name="LC1G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4POL" edc:desc="" edc:mask="0x1" edc:name="LC1G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC1POL" edc:desc="" edc:mask="0x1" edc:name="LC1POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC1SEL0" edc:desc="Input select register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC1SEL0" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF12">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D1S0" edc:desc="" edc:mask="0x1" edc:name="LC1D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S1" edc:desc="" edc:mask="0x1" edc:name="LC1D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S2" edc:desc="" edc:mask="0x1" edc:name="LC1D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S3" edc:desc="" edc:mask="0x1" edc:name="LC1D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D1S4" edc:desc="" edc:mask="0x1" edc:name="LC1D1S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D1S" edc:desc="" edc:mask="0x1f" edc:name="LC1D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0x1f" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC1SEL1" edc:desc="Input select register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC1SEL1" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF13">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D2S0" edc:desc="" edc:mask="0x1" edc:name="LC1D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S1" edc:desc="" edc:mask="0x1" edc:name="LC1D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S2" edc:desc="" edc:mask="0x1" edc:name="LC1D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S3" edc:desc="" edc:mask="0x1" edc:name="LC1D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D2S4" edc:desc="" edc:mask="0x1" edc:name="LC1D2S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D2S" edc:desc="" edc:mask="0x1f" edc:name="LC1D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0x1f" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D2S0" edc:desc="" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:desc="" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:desc="" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:desc="" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:desc="" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
